#책 코드 보고 clone coding 한 내용입니다.
##저는 아직 미숙아입니다....

# 현재 나이트의 위치 입력받기
input_data = input()
row = int(input_data[1])
column = int(ord(input_data[0])) - int(ord('a')) + 1

# 나이트가 이동할 수 있는 8가지 방향 정의
steps = [(-2, -1), (-1, -2), (1, -2), (2, -1), (2, 1), (1, 2), (-1, 2), (-2, 1)]
###이동하는 경우의 수가 8로 상대적으로 작다. --> 모든 이동 칸 수를 표현해도 ㅆㄱㄴ.

# 8가지 방향에 대하여 각 위치로 이동이 가능한지 확인
result = 0
for moving in steps:
    # 이동하고자 하는 위치 확인
    next_row = row + moving[0]
    next_column = column + moving[1]
    # 해당 위치로 이동이 가능하다면 카운트 증가
    if next_row >= 1 and next_row <= 8 and next_column >= 1 and next_column <= 8:
        result += 1

print(result)

##못 푼 이유에 대한 분석
#1. 입력을 받은 후 8가지 경우에 대해서 각각 해동 위치로 이동이 가능한지 체크할려고 했었음.
#-> 즉, 반복문을 사용하지 않았음. 그러니 코드가 길어졌고, 그 결과 간단하게 코드로 구현할 수 있는 문제였으나,
#   머리속에서 꼬이기 시작함. -> 결국 포기하게 됨.

## 이 문제에서 배운 점.
#1. 검사할 케이스가 적은 경우에는 모든 경우를 담은 리스트를 만들자.
#2. 내가 생각한 구현방법이 큰 틀에서의 문제 접근 방법은 유사하나 그 안의 작은 부분에서 차이가 발생하는 경우에는
#   for문과 if문을 (제어문) 적절히 사용하여 코드를 줄여, 코드의 길이를 낮추어 머리 속에서 복잡함을 줄이자.